vlm/extension/Documents/ПриобретениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПриобретениеТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_ПроцентБрака</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/extension/Documents/ПриобретениеТоваровУслуг/Ext/ObjectModule.bsl
&После("ЗаполнитьДокументНаОснованииЗаказаПоставщику")
Процедура бит_ЗаполнитьДокументНаОснованииЗаказаПоставщику(Знач ДокументОснование, Знач СкладПоступления, РеквизитыЗаказа)
	// {{ПервыйБИТ ЛистТребовани [ЛТ 5.23] [AVZhelansky@1cbit.ru] [03.06.2025 8:58:59] +   
	Для Каждого ТекСтрока Из Товары Цикл
		Если ТекСтрока.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.МногооборотнаяТара Тогда
			ТекСтрока.бит_Количество = ТекСтрока.Количество;
		Иначе
			ТекСтрока.бит_Количество = 0;
			ТекСтрока.бит_ПроцентБрака = 0;
		КонецЕсли;
	КонецЦикла;
	// }}ПервыйБИТ ЛистТребовани [ЛТ 5.23] [AVZhelansky@1cbit.ru] [03.06.2025 8:59:01] -
КонецПроцедуры

&После("ЗаполнитьДокументНаОснованииВозвратаТоваровПоставщику")
Процедура бит_ЗаполнитьДокументНаОснованииВозвратаТоваровПоставщику(Знач ДокументОснование)
	// {{ПервыйБИТ ЛистТребовани [ЛТ 5.23] [AVZhelansky@1cbit.ru] [03.06.2025 8:58:59] +   
	Для Каждого ТекСтрока Из Товары Цикл
		Если ТекСтрока.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.МногооборотнаяТара Тогда
			ТекСтрока.бит_Количество = ТекСтрока.Количество;
		Иначе
			ТекСтрока.бит_Количество = 0;
			ТекСтрока.бит_ПроцентБрака = 0;
		КонецЕсли;
	КонецЦикла;
	// }}ПервыйБИТ ЛистТребовани [ЛТ 5.23] [AVZhelansky@1cbit.ru] [03.06.2025 8:59:01] -
КонецПроцедуры
